Ran Plan for dir: `terraform/kubernetes` workspace: `default`

<details><summary>Show Output</summary>

```diff
data.cloudflare_zone.bryanwp: Read complete after 0s [id=d2287afe1d6fbddb1a27e1a5b85b0288]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # proxmox_virtual_environment_file.iso_image["1"] will be created
+ resource "proxmox_virtual_environment_file" "iso_image" {
      + content_type           = "iso"
      + datastore_id           = "backup-nas"
      + file_modification_date = (known after apply)
      + file_name              = (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      + id                     = (known after apply)
      + node_name              = "prox2"
      + overwrite              = true
      + timeout_upload         = 1800

      + source_file {
          + changed  = false
          + insecure = false
          + path     = "https://channels.nixos.org/nixos-23.05/latest-nixos-minimal-x86_64-linux.iso"
        }
    }

  # proxmox_virtual_environment_vm.kube_cp[0] must be replaced
-/+ resource "proxmox_virtual_environment_vm" "kube_cp" {
      ~ id                      = "500" -> (known after apply)
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
      ~ mac_addresses           = [
          - "26:72:40:FE:A1:E6",
        ] -> (known after apply)
        name                    = "cp.polaris-0"
      ~ network_interface_names = [] -> (known after apply)
      ~ started                 = false -> true
      ~ tags                    = [
          - "cp",
          - "k8s",
            "terraform",
          + "k8s",
          + "cp",
        ]
        # (20 unchanged attributes hidden)

      + clone {
          + full    = true # forces replacement
          + retries = 1 # forces replacement
          + vm_id   = 1000 # forces replacement
        }

      - cpu {
          - cores      = 1 -> null
          - flags      = [] -> null
          - hotplugged = 0 -> null
          - numa       = false -> null
          - sockets    = 1 -> null
          - type       = "qemu64" -> null
          - units      = 1024 -> null
        }

      ~ disk {
          ~ path_in_datastore = "vm-500-disk-0" -> (known after apply)
            # (7 unchanged attributes hidden)
        }

      ~ initialization {
          - interface    = "ide2" -> null
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

      ~ network_device {
          ~ mac_address = "26:72:40:FE:A1:E6" -> (known after apply)
            # (8 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # proxmox_virtual_environment_vm.kube_cp[1] must be replaced
-/+ resource "proxmox_virtual_environment_vm" "kube_cp" {
      ~ id                      = "501" -> (known after apply)
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
      ~ mac_addresses           = [
          - "06:F0:AD:DB:27:93",
        ] -> (known after apply)
        name                    = "cp.polaris-1"
      ~ network_interface_names = [] -> (known after apply)
      ~ started                 = false -> true
      ~ tags                    = [
          - "cp",
          - "k8s",
            "terraform",
          + "k8s",
          + "cp",
        ]
        # (20 unchanged attributes hidden)

      + clone {
          + full    = true # forces replacement
          + retries = 1 # forces replacement
          + vm_id   = 1000 # forces replacement
        }

      - cpu {
          - cores      = 1 -> null
          - flags      = [] -> null
          - hotplugged = 0 -> null
          - numa       = false -> null
          - sockets    = 1 -> null
          - type       = "qemu64" -> null
          - units      = 1024 -> null
        }

      ~ disk {
          ~ path_in_datastore = "vm-501-disk-0" -> (known after apply)
            # (7 unchanged attributes hidden)
        }

      ~ initialization {
          - interface    = "ide2" -> null
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

      ~ network_device {
          ~ mac_address = "06:F0:AD:DB:27:93" -> (known after apply)
            # (8 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # proxmox_virtual_environment_vm.kube_cp[2] must be replaced
-/+ resource "proxmox_virtual_environment_vm" "kube_cp" {
      ~ id                      = "502" -> (known after apply)
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
      ~ mac_addresses           = [
          - "1A:C1:57:3B:2F:65",
        ] -> (known after apply)
        name                    = "cp.polaris-2"
      ~ network_interface_names = [] -> (known after apply)
      ~ started                 = false -> true
      ~ tags                    = [
          - "cp",
          - "k8s",
            "terraform",
          + "k8s",
          + "cp",
        ]
        # (20 unchanged attributes hidden)

      + clone {
          + full    = true # forces replacement
          + retries = 1 # forces replacement
          + vm_id   = 1000 # forces replacement
        }

      - cpu {
          - cores      = 1 -> null
          - flags      = [] -> null
          - hotplugged = 0 -> null
          - numa       = false -> null
          - sockets    = 1 -> null
          - type       = "qemu64" -> null
          - units      = 1024 -> null
        }

      ~ disk {
          ~ path_in_datastore = "vm-502-disk-0" -> (known after apply)
            # (7 unchanged attributes hidden)
        }

      ~ initialization {
          - interface    = "ide2" -> null
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

      ~ network_device {
          ~ mac_address = "1A:C1:57:3B:2F:65" -> (known after apply)
            # (8 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # proxmox_virtual_environment_vm.kube_wk[0] must be replaced
-/+ resource "proxmox_virtual_environment_vm" "kube_wk" {
      ~ id                      = "550" -> (known after apply)
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
      ~ mac_addresses           = [
          - "BA:A4:B2:F9:1C:76",
        ] -> (known after apply)
        name                    = "wk.polaris-0"
      ~ network_interface_names = [] -> (known after apply)
      ~ started                 = false -> true
      ~ tags                    = [
          - "k8s",
            "terraform",
          + "k8s",
            "wk",
        ]
        # (20 unchanged attributes hidden)

      + clone {
          + full    = true # forces replacement
          + retries = 1 # forces replacement
          + vm_id   = 1000 # forces replacement
        }

      ~ cpu {
          + architecture = "x86_64"
          - flags        = [] -> null
            # (6 unchanged attributes hidden)
        }

      ~ disk {
          ~ path_in_datastore = "vm-550-disk-0" -> (known after apply)
            # (7 unchanged attributes hidden)
        }

      ~ initialization {
          - interface    = "ide2" -> null
            # (1 unchanged attribute hidden)

          ~ user_account {
              ~ password = (sensitive value)
                # (2 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }

      ~ network_device {
          ~ mac_address = "BA:A4:B2:F9:1C:76" -> (known after apply)
            # (8 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # proxmox_virtual_environment_vm.kube_wk[1] must be replaced
-/+ resource "proxmox_virtual_environment_vm" "kube_wk" {
      ~ id                      = "551" -> (known after apply)
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
      ~ mac_addresses           = [
          - "FE:AE:80:CE:21:81",
        ] -> (known after apply)
        name                    = "wk.polaris-1"
      ~ network_interface_names = [] -> (known after apply)
      ~ started                 = false -> true
      ~ tags                    = [
          - "k8s",
            "terraform",
          + "k8s",
            "wk",
        ]
        # (20 unchanged attributes hidden)

      + clone {
          + full    = true # forces replacement
          + retries = 1 # forces replacement
          + vm_id   = 1000 # forces replacement
        }

      ~ cpu {
          + architecture = "x86_64"
          - flags        = [] -> null
            # (6 unchanged attributes hidden)
        }

      ~ disk {
          ~ path_in_datastore = "vm-551-disk-0" -> (known after apply)
            # (7 unchanged attributes hidden)
        }

      ~ initialization {
          - interface    = "ide2" -> null
            # (1 unchanged attribute hidden)

          ~ user_account {
              ~ password = (sensitive value)
                # (2 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }

      ~ network_device {
          ~ mac_address = "FE:AE:80:CE:21:81" -> (known after apply)
            # (8 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # proxmox_virtual_environment_vm.kube_wk[2] must be replaced
-/+ resource "proxmox_virtual_environment_vm" "kube_wk" {
      ~ id                      = "552" -> (known after apply)
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
      ~ mac_addresses           = [
          - "C2:0E:33:CB:85:D7",
        ] -> (known after apply)
        name                    = "wk.polaris-2"
      ~ network_interface_names = [] -> (known after apply)
      ~ started                 = false -> true
      ~ tags                    = [
          - "k8s",
            "terraform",
          + "k8s",
            "wk",
        ]
        # (20 unchanged attributes hidden)

      + clone {
          + full    = true # forces replacement
          + retries = 1 # forces replacement
          + vm_id   = 1000 # forces replacement
        }

      ~ cpu {
          + architecture = "x86_64"
          - flags        = [] -> null
            # (6 unchanged attributes hidden)
        }

      ~ disk {
          ~ path_in_datastore = "vm-552-disk-0" -> (known after apply)
            # (7 unchanged attributes hidden)
        }

      ~ initialization {
          - interface    = "ide2" -> null
            # (1 unchanged attribute hidden)

          ~ user_account {
              ~ password = (sensitive value)
                # (2 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }

      ~ network_device {
          ~ mac_address = "C2:0E:33:CB:85:D7" -> (known after apply)
            # (8 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

Plan: 7 to add, 0 to change, 6 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/kubernetes`
* :put_litter_in_its_place: To **delete** this plan click [here](http://c4f00d43b117:4141/lock?id=resnostyle%252Fk8s-gitops%252Fterraform%252Fkubernetes%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/kubernetes`
</details>
Plan: 7 to add, 0 to change, 6 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`